{
	"introduction": "Experienced .NET developer, author, and trainer specializing in Azure and web technologies. Active in developer communities since being a Microsoft Student Partner.",
	"cards": [
		{
			"title": "Your .NET Consultant",
			"paragraphs": [
				"Expert .NET and Azure consultant delivering tailored business solutions.",
				"Specializing in ASP.NET Core, MAUI, and modern cloud architecture on Azure.",
				"Microsoft developer with proven enterprise project success.",
				"Serving startups, SMEs, and digital service companies across multiple industries."
			],
			"images": [
				"dotnet.svg",
				"csharp.svg",
				"azure.svg"
			]
		},
		{
			"title": "Your Trainer",
			"paragraphs": [
				"Experienced .NET and Azure trainer for developers and companies. ",
				"LinkedIn Learning paragraphs creator focusing on Microsoft technologies.",
				"Proven track record training teams in France, Belgium, and Luxembourg.",
				"Expert in .NET 9, Blazor Server, and Azure cloud solutions."
			],
			"icons": [
				"fab fa-linkedin linkedin-logo"
			],
			"link": "#training"
		},
		{
			"title": "Passionnated",
			"paragraphs": [
				"Dedicated Microsoft technology expert staying current with latest trends.",
				"Committed to delivering innovative .NET solutions meeting client needs.",
				"Active developer community participant since Microsoft Student Partner days.",
				"Passionate about mobile development, web technologies, and cloud architecture."
			],
			"link": "#contact"
		},
		{
			"title": "Diverse experiences",
			"paragraphs": [
				"Successfully delivered projects across medical, finance, aviation, and logistics sectors.",
				"Expertise spanning healthcare statistics, insurance software, and education platforms.",
				"Proven experience with multiple companies.",
				"Mobile developer specializing in MAUI, Xamarin, and cross-platform solutions."
			],
			"link": "#experiences"
		},
		{
			"title": "Recent projects",
			"paragraphs": [
				"Improved healthcare data portals for Medtech and CEESA using .NET 9.",
				"Enhanced TRIGO logistics software using advanced .NET development and Vue.js.",
				"Led Active Assurances team developing comprehensive insurance management system.",
				"Specialized in Azure migration, CI/CD implementation, and clean architecture design."
			],
			"link": "#experiences"
		},
		{
			"title": "Personal attributes",
			"paragraphs": [
				"Curious and versatile developer with strong analytical design skills.",
				"Talented at explaining complex technical concepts to diverse audiences.",
				"Collaborative team leader thriving in dynamic development environments.",
				"Trilingual consultant comfortable working across French, Spanish, and English markets."
			]
		}
	],
	"languages": [
		"French (Native)",
		"Spanish (Native)",
		"English (Professional)"
	]
}
