{
	"introduction": "As an experienced developer, author, and trainer in mobility and web technologies, I’ve been an active participant in developer communities since my time as a Microsoft Student Partner.",
	"cards": [
		{
			"title": "Your .NET Consultant",
			"paragraphs": [
				"Specializing in .NET and Azure technologies, I provide expert consulting services to businesses looking to leverage these powerful platforms."
			],
			"images": [
				"dotnet.svg",
				"csharp.svg",
				"azure.svg"
			]
		},
		{
			"title": "Your trainer",
			"paragraphs": [
				"Experienced trainer in .NET and Azure technologies for training centers and universities, helping developers enhance their skills.",
				"Content creator for LinkedIn Learning platform."
			],
			"icons": [
				"fa-brands fa-linkedin text-blue"
			],
			"link": "#trainingcenters"
		},
		{
			"title": "My passion",
			"paragraphs": [
				"I’m passionate about development and training, and I’ve consistently met customer needs by using the latest technologies."
			],
			"link": "#contact"
		},
		{
			"title": "My experiences",
			"paragraphs": [
				"...with start-ups, SMEs, and digital service companies (ESN / IT) have reinforced my technology choices, particularly those focused on the future."
			],
			"link": "#experiences"
		},
		{
			"title": "Recent projects",
			"paragraphs": [
				"At TRIGO, I enhanced logistics software systems using advanced .NET development, Vue, and Azure.",
				"At Active Assurances, I led a team to improve internal processes and develop internal tools.",
				"These experiences honed my leadership skills and deepened my technical expertise."
			],
			"link": "#experiences"
		},
		{
			"title": "Personal attributes",
			"paragraphs": [
				"Curious, versatile, and quick to get excited about new ideas and projects. I value knowledge and have a knack for understanding and explaining complex concepts easily.",
				"Comfortable in positions where my analytical and design skills are highlighted. While calmer than other extroverted types, I still require a minimum level of social interaction to maintain my energy."
			]
		}
	],
	"industries": [
		"I’m mobile across Europe for training purposes.",
		"I’ve applied my skills in various sectors including:",
		"finance",
		"aviation",
		"logistics",
		"education",
		"accounting"
	],
	"languages": [
		"French (Native)",
		"Spanish (Native)",
		"English (Professional)"
	]
}
