{
  "aboutMeSection": {
    "introduction": [
      "As an experienced developer, author, and trainer in mobility and web technologies, I’ve been an active participant in developer communities since my time as a Microsoft Student Partner.",
      "I’m passionate about development and training, and I’ve consistently met customer needs by using the latest technologies.",
      "My experiences with start-ups, SMEs, and digital service companies (ESN / IT) have reinforced my technology choices, particularly those focused on the future."
    ],
    "keyTechnologies": [
      {
        "Title": "Frameworks",
        "Paragraphs1": [],
        "Images": [
          ".NET",
          "C#"
        ],
        "Paragraphs2": []
      },
      {
        "Title": "Web",
        "Paragraphs1": [],
        "Images": [
          "Blazor",
          "React.js"
        ],
        "Paragraphs2": []
      },
      {
        "Title": "Mobile Apps",
        "Paragraphs1": [],
        "Images": [
          "iOS",
          "Android",
          "UWP"
        ],
        "Paragraphs2": []
      },
      {
        "Title": "Data",
        "Paragraphs1": [],
        "Images": [
          "CosmosDB",
          "SQL Server",
          "GraphQL"
        ],
        "Paragraphs2": []
      },
      {
        "Title": "Cloud",
        "Paragraphs1": [
          
        ],
        "Images": [
          "Azure",
          "Dynamics365",
          "Power Platform"
        ],
        "Paragraphs2": []
      },
      {
        "Title": "Tools",
        "Paragraphs1": [],
        "Images": [
          "Azure DevOps",
          "GitHub"
        ],
        "Paragraphs2": []
      }
    ],
    "industries": [
      "I’m mobile across Europe for training purposes.",
      "I’ve applied my skills in various sectors including:",
      "finance",
      "aviation",
      "logistics",
      "education",
      "accounting"
    ],
    "recentProjects": [
      "At TRIGO, I enhanced logistics software systems using advanced .NET development, Vue, and Azure.",
      "At Active Assurances, I led a team to improve internal processes and develop new insurance software from scratch.",
      "These experiences honed my leadership skills and deepened my technical expertise."
    ],
    "personalAttributes": [
      "I’m curious, versatile, and quick to get excited about new ideas and projects. I value knowledge and have a knack for understanding and explaining complex concepts easily. I’m comfortable in positions where my analytical and design skills are highlighted. Although calmer than other extroverted types, I still require a minimum level of social interaction to maintain my energy."
    ],
    "languages": [
      "French (Native)",
      "Spanish (Native)",
      "English (Professional)"
    ]
  }
}