{
    "aboutMe": [
        "As an experienced developer, author, and trainer in mobility and web technologies, I’ve been an active participant in developer communities since my time as a Microsoft Student Partner.",
        "I’m passionate about development and training, and I’ve consistently met customer needs by using the latest technologies.",
        "My experiences with start-ups, SMEs, and digital service companies (ESN / IT) have reinforced my technology choices, particularly those focused on the future.",
        "### Key Technologies",
        "- Web: ASP.NET Core, Blazor",
        "- Mobile: MAUI, Xamarin, UWP",
        "- Cloud: Azure",
        "- Design patterns: DDD, Clean Architecture, TDD, SOLID, 20 of gang, cloud, ...",
        "- Languages: C#, JavaScript, TypeScript",
        "- Databases: SQL Server, Cosmos DB",
        "- Tools: Visual Studio, Visual Studio Code, Azure DevOps, GitHub",
        "- Methodologies: Agile, Scrum, Kanban",
        "- frameworks: .NET",
        "### Industry Experience",
        "I’ve applied my skills in various sectors including finance, aviation, logistics, education, and accounting. I’m mobile across Europ for training purposes.",
        "### Recent projects",
        "At TRIGO, I enhanced logistics software systems using advanced .NET development, Vue, and Azure. At Active Assurances, I led a team to improve internal processes and develop new insurance software from scratch. These experiences honed my leadership skills and deepened my technical expertise.",
        "### Personal Attributes",
        "I’m curious, versatile, and quick to get excited about new ideas and projects. I value knowledge and have a knack for understanding and explaining complex concepts easily. I’m comfortable in positions where my analytical and design skills are highlighted. Although calmer than other extroverted types, I still require a minimum level of social interaction to maintain my energy.",
        "Looking forward to connecting with you soon!"
    ],
    "experiences": [
        {
            "title": "Founder - freelance .NET developer, techlead and trainer",
            "company": "IdeaStudio",
            "mode": "Self-employed",
            "interval": "May 2017 - Present · 7 yrs 2 mos",
            "location": "Paris Area, France",
            "description": "At IdeaStud.io, my passion for technology and entrepreneurship comes to life. I am the driving force behind IdeaStud.io, developing innovative mobile and web applications for a diverse range of industries, from large corporations to startups across various sectors. My work primarily involves leveraging the latest Microsoft technologies, with a special focus on cloud-based applications. As a tech enthusiast, Iʼm always ready to embrace new challenges and stay ahead of the curve. Iʼm proficient in the latest technologies and frameworks, and Iʼm constantly updating my skills to keep up with the rapidly evolving tech landscape. In addition to application development, I also share my knowledge and expertise through various training centers such as SQLI Institute, Next Formation, and IP-Formation. I teach a range of techniques and technologies, with a focus on cloud computing and software architecture. This journey reflects my commitment to continuous learning, my ability to adapt to new challenges, and my passion for sharing knowledge in the tech industry.",
            "skills": [
                "Blazor",
                "Azure DevOps",
                "Microsoft Power Apps",
                "Domain-Driven Design (DDD)",
                "GitHub",
                "Mobile Applications",
                ".NET",
                "React.js",
                "Angular",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Xamarin",
                "FinOps",
                "Azure Static Web Apps",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Architecture",
                "Swagger",
                "Azure Cosmos DB",
                "Azure Data Factory",
                "API Development",
                "GraphQL",
                "Azure Service Bus",
                "Azure Functions",
                "Azure Automation",
                "SQL"
            ]
        },
        {
            "title": ".NET Developer",
            "company": "TRIGO",
            "mode": "Freelance",
            "interval": "Feb 2024 - Present · 5 mos",
            "location": "Lyon, Auvergne-Rhône-Alpes, France · Hybrid",
            "description": "TRIGO is a global leader in logistics, providing specialised logistics and production support. They are known for their professional support, systems, and flexibility that help exceed their customersʼ expectations. In this context, I was brought in to develop new features for an ASP.NET Framework (MVC4) and support migrations to .NET, Vue, Azure.",
            "responsibilities": [
                "Conducted thorough analysis of existing projects to identify areas for improvement and potential issues.",
                "Conducted a comprehensive analysis of existing projects to understand their structure and functionality.",
                "Implemented unit tests to ensure the reliability and stability of the software.",
                "Developed several key features on the WebApp, enhancing its functionality and user experience.",
                "Performed analysis of the mobile app to understand its structure and functionality.",
                "Developed Vue3 components, contributing to the modernisation of the application.",
                "Shared knowledge and expertise with team members, fostering a collaborative and learning-oriented environment.",
                "Assisted in the migration of applications to Azure, leveraging Azure WebApp and Azure Functions for efficient and scalable solutions.",
                "Collaborated with the team to troubleshoot and resolve technical issues.",
                "Participated in code reviews to maintain high-quality code.",
                "Worked closely with stakeholders to understand their needs and translate them into technical requirements.",
                "Stayed up-to-date with the latest industry trends and technologies, and applied this knowledge to my work."
            ],
            "skills": [
                "Azure DevOps",
                "Mobile Applications",
                ".NET",
                ".NET Framework",
                "Vue",
                "ASP.NET Core",
                "Microsoft Azure",
                "Azure Storage",
                "Test-Driven Development",
                "Vue.js",
                "ASP.NET",
                "C#",
                "Azure Service Bus",
                "Azure Functions",
                "Azure SQL"
            ]
        },
        {
            "title": "Techlead",
            "company": "Active Assurances",
            "mode": "Freelance",
            "interval": "Aug 2023 - Feb 2024 · 7 mos",
            "location": "Paris, Île-de-France, France · Hybrid",
            "description": "Active Assurances is a leading provider of automobile insurance products and services in France. They were looking to improve internal processes and redesign some projects, with many migrations attempted to the .NET environment. A new project was implemented from scratch, fully replacing the entire Information System.",
            "responsibilities": [
                "Managed a team of up to 5 developers.",
                "Conducted analysis of existing projects to identify areas for improvement.",
                "Improved the delivery process and organised git repositories.",
                "Enhanced CI/CD pipelines for better efficiency.",
                "Developed several key features for the new system.",
                "Trained developers on new technologies and best practices.",
                "Handled Azure subscription migration and FinOps.",
                "Improved application security and upgraded certain projects to .NET 8.",
                "Implemented a database migration system to replicate data across different environments."
            ],
            "skills": [
                "Blazor",
                "Azure DevOps",
                "Entity Framework Core",
                "Microsoft Power Apps",
                "Azure Logic Apps",
                "Domain-Driven Design (DDD)",
                ".NET",
                "React.js",
                "Angular",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Techlead",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "FinOps",
                "Azure Static Web Apps",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Architecture",
                "Swagger",
                "API Development",
                "Azure Service Bus",
                "Clean Architecture",
                "Azure Functions",
                "Azure Automation",
                "SQL"
            ]
        },
        {
            "title": ".NET Developer",
            "company": "The Adecco Group",
            "mode": "Freelance",
            "interval": "Apr 2022 - Apr 2023 · 1 yr 1 mo",
            "location": "Lyon, Auvergne-Rhône-Alpes, France · Hybrid",
            "description": "The Adecco Group is a Swiss-French company based in Zurich, Switzerland. It is one of the world's largest Human Resources provider and temporary staffing firm. I worked on multiple projects at The Adecco Group. The main project was a worldwide data synchronisation system.",
            "responsibilities": [
                "Conducted functional analysis and analysis of existing developments.",
                "Developed applications and services for multiple internal products.",
                "Handled migrations from .net core3 to .net6 and performed refactoring.",
                "Managed deployment and provided support.",
                "Conducted research and development on Azure Managed Identities, Azure RBAC, etc."
            ],
            "skills": [
                "Blazor",
                "Azure DevOps",
                "Azure Logic Apps",
                "Domain-Driven Design (DDD)",
                ".NET",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure API Management",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Architecture",
                "Swagger",
                "Azure Cosmos DB",
                "API Development",
                "Azure Service Bus",
                "Azure Functions",
                "Microservices",
                "SQL"
            ]
        },
        {
            "title": ".NET Developer",
            "company": "Sage",
            "mode": "Freelance",
            "interval": "Oct 2021 - Feb 2022 · 5 mos",
            "location": "Remote",
            "description": "Sage is a British multinational enterprise software company. They were redeveloping some internal libraries and their commercial products. I developed and improved new features.",
            "responsibilities": [
                "Conducted functional analysis and analysis of existing developments and architectures (onion/hexagonal).",
                "Developed APIs and micro-services.",
                "Developed unit tests and conducted research and development.",
                "Contributed to the development of a project from scratch (implementation of onion architecture, unit tests, etc.)."
            ],
            "skills": [
                "Domain-Driven Design (DDD)",
                "GitHub",
                ".NET",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Architecture",
                "Swagger",
                "Azure Cosmos DB",
                "API Development",
                "GraphQL",
                "Azure Service Bus",
                "Clean Architecture",
                "Azure Functions",
                "Microservices"
            ]
        },
        {
            "title": "Mobile Application Developer",
            "company": "Hager",
            "mode": "Freelance",
            "interval": "Aug 2021 - Oct 2021 · 3 mos",
            "location": "Obernai, Grand Est, France · Hybrid",
            "description": "Hager is a leading supplier of solutions and services for electrical installations in residential, commercial, and industrial buildings. The task was to develop an application that uses an existing AI to find spare parts.",
            "responsibilities": [
                "Performed functional analysis ",
                "Connected Xamarin.Forms to ONNX files to integrate developed IA",
                "Connected to several Azure services.",
                "Prepared packages and pipelines for deployment"
            ],
            "skills": [
                "UWP",
                "Azure DevOps",
                "Mobile Applications",
                ".NET",
                "Cloud Computing",
                "Azure Key Vault",
                "Techlead",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Xamarin",
                "FinOps",
                ".NET Core",
                "C#",
                "Architecture",
                "Swagger",
                "API Development",
                "Clean Architecture",
                "Azure Functions"
            ]
        },
        {
            "title": ".NET Developer",
            "company": "ALTEVA",
            "mode": "Freelance",
            "interval": "Apr 2021 - Jun 2021 · 3 mos",
            "location": "Remote · Remote",
            "description": "Alteva is a leading provider of software solutions for property management, with over 20 years of experience in the field. Their software, Mission One, is designed to cater to various stakeholders in property maintenance.",
            "responsibilities": [
                "Conducted functional analysis to understand the requirements and specifications of the software.",
                "Engaged in research and development to explore new technologies and methodologies.",
                "Realised several Proof of Concepts (PoCs) to validate the feasibility of solutions.",
                "Provided training to teams, enhancing their .NET skills and knowledge.",
                "Made contributions to the Continuous Deployment/Continuous Integration (CD/CI) pipelines, improving the efficiency of the development process.",
                "Developed unit tests to ensure the reliability and stability of the software."
            ],
            "skills": [
                "Blazor",
                "Redux",
                "Domain-Driven Design (DDD)",
                ".NET",
                "React.js",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Swagger",
                "API Development",
                "Azure Functions",
                "Microservices"
            ]
        },
        {
            "title": ".NET and Azure Architect",
            "company": "Faurecia",
            "mode": "Freelance",
            "interval": "Sep 2020 - Apr 2021 · 8 mos",
            "location": "France",
            "description": "Faurecia is a global leader in automotive technology. They are known for their innovative solutions that enhance the driving experience and contribute to sustainable mobility.",
            "responsibilities": [
                "Conducted both technical and functional analysis to understand the requirements and specifications of the projects.",
                "Analyzed existing developments to identify areas for improvement and potential issues.",
                "Worked on architectures (NLayered and Onion) to ensure the software is well-structured and maintainable.",
                "Engaged in research and development to explore new technologies and methodologies.",
                "Handled migration of code to ensure smooth transition and minimal disruption.",
                "Developed APIs and .NET applications to meet the needs of the projects.",
                "Created NuGet packages for efficient management and distribution of .NET packages.",
                "Developed Azure Functions with an orchestrator to manage the execution of functions.",
                "Set up Azure Data Factory and Azure EventHubs for data integration and real-time analytics."
            ],
            "skills": [
                "Azure DevOps",
                "Azure Logic Apps",
                ".NET",
                "Cloud Computing",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "FinOps",
                "ASP.NET",
                ".NET Core",
                "Azure Kubernetes Service (AKS)",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Architecture",
                "Swagger",
                "Azure Cosmos DB",
                "Azure Data Factory",
                "Azure Event Hubs",
                "Azure Service Bus",
                "Azure Functions",
                "Azure Automation",
                "MongoDB"
            ]
        },
        {
            "title": ".NET and Azure Architect",
            "company": "CHARL'ANTOINE ALSACE",
            "mode": "Freelance",
            "interval": "Jun 2020 - Sep 2020 · 4 mos",
            "location": "France · Remote",
            "description": "CharlʼAntoine Alsace is a company specializing in delivery services. They are known for their efficient and reliable delivery solutions.",
            "responsibilities": [
                "Conducted analysis of existing developments to understand the structure and functionality of the current app.",
                "Worked closely with the customer to analyze functional needs and translate them into technical requirements.",
                "Designed the architecture of the new app, ensuring it is scalable and maintainable.",
                "Developed tests following the Test-Driven Development (TDD) approach to ensure the reliability and stability of the app.",
                "Developed APIs to facilitate communication between the app and the backend systems.",
                "Developed the mobile app, enhancing its functionality and user experience.",
                "Developed an administration console for managing the app and monitoring its performance.",
                "Ensured the app is secure and data is protected.",
                "Optimized the performance of the app for a smooth user experience.",
                "Provided training and support to the team on the new technologies and best practices used in the app.",
                "Bonus: Proficient in Polly.NET, a .NET resilience and transient-fault-handling library, and Simmy, a chaos engineering and fault injection library for .NET."
            ],
            "skills": [
                "Blazor",
                "UWP",
                "Azure DevOps",
                "Microsoft Power Apps",
                "Azure Logic Apps",
                "Mobile Applications",
                ".NET",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Architecture",
                "Swagger",
                "API Development",
                "GraphQL",
                "Azure Functions",
                "Azure Automation"
            ]
        },
        {
            "title": "Business Analyst",
            "company": "Renault-Nissan-Mitsubishi",
            "mode": "Freelance",
            "interval": "Feb 2020 - Apr 2020 · 3 mos",
            "location": "Issy-les-Moulineaux, Ile-de-France, France · Hybrid",
            "description": "Renault France, part of an alliance with Mitsubishi and Nissan, is a leading vehicle provider.",
            "responsibilities": [
                "I conducted analysis of existing developments and worked closely with the final customer to analyze functional needs. ",
                "I also held meetings with development teams and customers (Renault, Mitsubishi, Nissan, etc.), wrote functional specifications in Azure DevOps.",
                "Validated these with the final customer.",
                "I configured Azure DevOps, reviewed code of off-shore teams, and documented differences in code and APIs specifications."
            ],
            "skills": [
                "Azure DevOps",
                ".NET",
                "Cloud Computing",
                "Techlead",
                "Microsoft Azure",
                "ASP.NET",
                "C#",
                "Azure Service Bus",
                "SQL"
            ]
        },
        {
            "title": ".NET and Azure Techlead",
            "company": "Cegid",
            "mode": "Freelance",
            "interval": "Aug 2019 - Dec 2019 · 5 mos",
            "location": "Paris Area, France · Hybrid",
            "description": "Cegid is a leading provider of cloud business management solutions for finance, human resources, CPAs, and the retail and entrepreneurial sectors.",
            "responsibilities": [
                "Designed the architecture of the new box.",
                "Conducted PoCs about different solutions to store data, durable functions, orchestrator, centralised configuration, etc.",
                "Performed functional analysis and analysed existing developments.",
                "Worked on refactoring & clean code.",
                "Implemented Azure services (Functions, Centralized configuration, App Service, etc.).",
                "Coached about best practices: micro-services, serverless, .NET Core, design patterns (development and cloud).",
                "Participated in the development of 3 projects: Box, CDA, Stream."
            ],
            "skills": [
                "Azure DevOps",
                "Azure Logic Apps",
                "Domain-Driven Design (DDD)",
                ".NET",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Techlead",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Swagger",
                "Azure Cosmos DB",
                "API Development",
                "Azure Service Bus",
                "Clean Architecture",
                "Azure Functions",
                "Microservices",
                "SQL",
                "Behavior-Driven Development (BDD)"
            ]
        },
        {
            "title": ".NET and Azure Consultant",
            "company": "Corum",
            "mode": "Freelance",
            "interval": "May 2019 - Aug 2019 · 4 mos",
            "location": "Paris Area, France",
            "description": "Corum is a French company that specializes in providing investment solutions, particularly in real estate.",
            "responsibilities": [
                "Conducted functional analysis to understand the requirements and specifications of the software.",
                "Engaged in research and development to explore new technologies and methodologies.",
                "Realized several Proof of Concepts (PoCs) to validate the feasibility of solutions.",
                "Provided training to teams, enhancing their .NET skills and knowledge.",
                "Made contributions to the Continuous Deployment/Continuous Integration (CD/CI) pipelines, improving the efficiency of the development process.",
                "Developed unit tests to ensure the reliability and stability of the software."
            ],
            "skills": [
                "Azure DevOps",
                "Microsoft Power Apps",
                ".NET",
                "React.js",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure API Management",
                "Microsoft Azure",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "API Development",
                "Microservices",
                "Microsoft Dynamics"
            ]
        },
        {
            "title": ".NET Techlead",
            "company": "DAVIGOLD",
            "mode": "Freelance",
            "interval": "Oct 2018 - May 2019 · 8 mos",
            "location": "Paris Area, France · Hybrid",
            "description": "DAVIGOLD is a next-generation Fintech company that optimizes private equity operations.",
            "responsibilities": [
                "Conducted analysis of current developments and performed functional study to understand the requirements and specifications of the software.",
                "Developed Web APIs with Swagger and Open API.",
                "Developed unit tests and integration tests using NUnit to ensure the reliability and stability of the software.",
                "Handled both on-premise and cloud deployment of the application.",
                "Managed the project, ensuring it is delivered on time and within budget.",
                "Managed different providers, coordinating and communicating effectively to ensure smooth operations."
            ],
            "skills": [
                "Azure DevOps",
                ".NET",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Techlead",
                "Microsoft Azure",
                "Azure Monitor",
                "Azure Storage",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "Continuous Integration and Continuous Delivery (CI/CD)",
                "Swagger",
                "API Development",
                "Azure Functions",
                "Microservices",
                "SQL"
            ]
        },
        {
            "title": ".NET Developer (WPF)",
            "company": "FORTIA Financial Solutions",
            "mode": "Freelance",
            "interval": "Oct 2017 - Dec 2017 · 3 mos",
            "location": "Paris Area, France · On-site",
            "description": "FORTIA is a financial technology company specialising in innovative solutions for the investment management industry. I contributed to the development of the Innova application, a comprehensive tool designed for data management, enterprise risk management, and business process management.",
            "responsibilities": [
                "Conducted functional analysis to understand the business requirements.",
                "Engaged in research and development activities, focusing on fleet management and map components.",
                "Performed reverse engineering of an existing application to understand its architecture and functionality.",
                "Designed the architecture of the web application, ensuring scalability and performance.",
                "Developed the MVC web application, APIs, and JavaScript (Bing Maps, Ajax) to meet the project requirements.",
                "Contributed to and participated in the establishment of DevOps processes using Visual Studio Team Services/Azure DevOps.",
                "Conducted Proof of Concepts (PoCs) on Bing Maps, Azure Maps, storage options, etc., to explore the best solutions for the project.",
                "Coached developers to enhance their skills, fostering a culture of continuous learning and improvement within the team."
            ],
            "skills": [
                ".NET",
                ".NET Framework",
                "Cloud Computing",
                "Test-Driven Development",
                "ASP.NET",
                "C#",
                "WPF"
            ]
        },
        {
            "title": ".NET Developer",
            "company": "AFILIZA",
            "mode": "Freelance",
            "interval": "Jun 2017 - Sep 2017 · 4 mos",
            "location": "Paris Area, France",
            "description": "AFILIZA is a digital agency focused on creating effective online presence for businesses. I was involved in the research and development of a web application for displaying promotion codes, enhancing the user experience and driving customer engagement.",
            "responsibilities": [
                "Application development",
                "Data management",
                "Research and development",
                "User experience enhancement"
            ],
            "skills": [
                "Azure DevOps",
                ".NET",
                "Cloud Computing",
                "Web Development",
                "ASP.NET Core",
                "Azure Key Vault",
                "Microsoft Azure",
                "Azure Monitor",
                "Test-Driven Development",
                "ASP.NET",
                ".NET Core",
                "C#",
                "API Development"
            ]
        },
        {
            "title": "Business Unit Manager + .NET developer",
            "company": "Digit-Prime",
            "mode": "Full-time",
            "interval": "Nov 2016 - Apr 2017 · 6 mos",
            "location": "Paris Area, France",
            "description": "Digit-Prime is a technology company offering a range of services from training to application development. I led training sessions and developed applications, fostering a culture of continuous learning and improvement.",
            "responsibilities": [
                "Web application development",
                "Research and development",
                "User experience enhancement"
            ],
            "skills": [
                "Cloud Computing"
            ]
        },
        {
            "title": "Freelance .NET Software Developer and trainer",
            "company": "Andrés Talavera",
            "mode": "Freelance",
            "interval": "Jul 2015 - Nov 2016 · 1 yr 5 mos",
            "location": "France"
        }
    ]
}